import { galleryItems } from './gallery-items.js';

//todo__________________________________________________________
/*
Выполняй это задание в файлах 01-gallery.html и 01-gallery.js.
Разбей его на несколько подзадач:*/

//! 1.
/*Создание и рендер разметки по массиву данных galleryItems и 
предоставленному шаблону элемента галереи.

//!2.
Реализация делегирования на div.gallery и получение url 
большого изображения.

//!3.
Подключение скрипта и стилей библиотеки модального окна 
basicLightbox. Используй CDN сервис jsdelivr и добавь в проект 
ссылки на минифицированные (.min) файлы библиотеки.

//!4.
Открытие модального окна по клику на элементе галереи. 
Для этого ознакомься с документацией и примерами.

//!5.
Замена значения атрибута src элемента <img> в модальном окне 
перед открытием. Используй готовую разметку модального окна с 
изображением из примеров библиотеки basicLightbox.
*/
//todo__________________________________________________________




console.log(galleryItems);
